# Name Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PaperSource..::..Name Property
PaperSource Class See Also
---
Retrieve the paper source name of current project.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public string Name { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Name As String
	Get
```

Visual C++
---
```text
public:
property String^ Name {
	String^ get ();
}
```

# See Also
PaperSource Class
Autodesk.Revit.DB Namespace